005 Test/Stress Tests/Additional_information/BT07_Retrieve_ICA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ec="ec:services:wsdl:RetrieveInterchangeAgreementsRequest-2" xmlns:ec1="ec:schema:xsd:CommonAggregateComponents-2" xmlns:stan="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:urn="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:urn1="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
   <soapenv:Header>
      <ec:Header>
         <ec1:BusinessHeader>
            <stan:Sender>
               <stan:Identifier>TRUSTSUPPARTY1</stan:Identifier>
            </stan:Sender>
         </ec1:BusinessHeader>
      </ec:Header>
   </soapenv:Header>
   <soapenv:Body>
      <ec:SubmitRetrieveInterchangeAgreementsRequestRequest xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
         <ec:RetrieveInterchangeAgreementsRequest>
            <cac:SenderParty>
               <cbc:EndpointID>TRUSTSUPPARTY1</cbc:EndpointID>
            </cac:SenderParty>
            <cac:ReceiverParty>
               <cbc:EndpointID>TRUSTCUSTPARTY1</cbc:EndpointID>
            </cac:ReceiverParty>
            <cbc:DocumentTypeCode>BDL</cbc:DocumentTypeCode>
         </ec:RetrieveInterchangeAgreementsRequest>
      </ec:SubmitRetrieveInterchangeAgreementsRequestRequest>
   </soapenv:Body>
</soapenv:Envelope>
